app/controllers/boards_controller.rb

INSERT INTO "boards" ("created_at", "data", "turns", "updated_at", "winner") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 22 Jun 2013 13:14:15 UTC +00:00], ["data", "--- {}\n"], ["turns", 0], ["updated_at", Sat, 22 Jun 2013 13:14:15 UTC +00:00], ["winner", nil]]
---
  def new
    @board = Board.new
    @board.save!

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "15"]]
UPDATE "boards" SET "turns" = 4, "updated_at" = '2013-06-22 12:23:16.568857' WHERE "boards"."id" = 2
---
  def update
    @board = Board.find(params[:id])
    @board.place_piece(params[:player], params[:place_x].to_i)
    @winner = @board.find_winner(params[:place_x].to_i)
    unless @winner
      pos = Ai.place_piece(@board)
      @board.place_piece(@board.turn, pos)
      @winner = @board.find_winner(pos)
    end
    @board.save!